dict_RU = {0: 'Ноль ', 1: 'Один ', 2: 'Два ', 3: 'Три ', 4: 'Четыре ', 5: 'Пять ', 6: 'Шесть ', 7: 'Семь ', 8: 'Восемь ', 9: 'Девять ',10: 'Десять ',
        11: 'Одиннадцать ', 12: 'Двенадцать', 13: 'Тринадцать', 14: 'Четырнадцать', 15: 'Пятнадцать', 16: 'Шестнадцать',17: 'Семнадцать', 18: 'Восемнадцать', 19: 'Девятнадцать', 20: 'Двадцать',
        21: 'Двадцать один ', 22: 'Двадцать два', 23: 'Двадцать три', 24: 'Двадцать четыре', 25: 'Двадцать пять', 26: 'Двадцать шесть', 27: 'Двадцать семь', 28: 'Двадцать восемь', 29: 'Двадцать девять', 30: 'Тридцать',
        31: 'Тридцать один', 32: 'Тридцать два', 33: 'Тридцать три', 34: 'Тридцать четыре', 35: 'Тридцать пять', 36: 'Тридцать шесть', 37: 'Тридцать семь', 38: 'Тридцать восемь',39: 'Тридцать девять',
        40: 'Сорок', 41: 'Сорок один', 42: 'Сорок два', 43: 'Сорок три', 44: 'Сорок четыре', 45: 'Сорок пять', 46: 'Сорок шесть', 47: 'Сорок семь', 48: 'Сорок восемь', 49: 'Сорок девять', 50: 'Пятьдесят',
        51: 'Пятьдесят один', 52: 'Пятьдесят два', 53: 'Пятьдесят три', 54: 'Пятьдесят четыре', 55: 'Пятьдесят пять', 56: 'Пятьдесят шесть', 57: 'Пятьдесят семь', 58: 'Пятьдесят восемь', 59: 'Пятьдесят девять', 60: 'Шестьдесят',
        61: 'Шестьдесят один', 62: 'Шестьдесят два', 63: 'Шестьдесят три', 64: 'Шестьдесят четыре', 65: 'Шестьдесят пять', 66: 'Шестьдесят шесть', 67: 'Шестьдесят семь', 68: 'Шестьдесят восемь', 69: 'Шестьдесят девять', 70: 'Семьдесят',
        71: 'Семьдесят один', 72: 'Семьдесят два', 73: 'Семьдесят три', 74: 'Семьдесят четыре', 75: 'Семьдесят пять', 76: 'Семьдесят шесть', 77: 'Семьдесят семь', 78: 'Семьдесят восемь', 79: 'Семьдесят девять', 80: 'Восемьдесят',
        81: 'Восемьдесят один', 82: 'Восемьдесят два', 83: 'Восемьдесят три', 84: 'Восемьдесят четыре', 85: 'Восемьдесят пять', 86: 'Восемьдесят шесть', 87: 'Восемьдесят семь', 88: 'Восемьдесят восемь', 89: 'Восемьдесят девять', 90: 'Девяносто',
        91: 'Девяносто один', 92: 'Девяносто два', 93: 'Девяносто три', 94: 'Девяносто четыре', 95: 'Девяносто пять', 96: 'Девяносто шесть', 97: 'Девяносто семь', 98: 'Девяносто восемь', 99: 'Девяносто девять', 100: 'Сто'
}

dict_EN = {0: 'Zero ', 1: 'One ', 2: 'Two ', 3: 'Three ', 4: 'Four ', 5: 'Five ', 6: 'Six  ', 7: 'Seven ', 8: 'Eight ', 9: 'Nine ',10: 'Ten ',
        11: 'Eleven ', 12: 'Twelve', 13: 'Thirteen', 14: 'Fourteen', 15: 'Fifteen', 16: 'Sixteen',17: 'Seventeen', 18: 'Eighteen', 19: 'Nineteen', 20: 'Twenty',
        21: 'Twenty-one', 22: 'Twenty-two', 23: 'Twenty-three', 24: 'Twenty-four', 25: 'Twenty-five', 26: 'Twenty-six', 27: 'Twenty-seven', 28: 'Twenty eight', 29: 'Twenty nine', 30: 'Thirty',
        31: 'Thirty one', 32: 'Thirty two', 33: 'Thirty three', 34: 'Thirty four', 35: 'Thirty five', 36: 'Thirty six', 37: 'Thirty seven', 38: 'Thirty eight', 39: 'Thirty nine',  40: 'Forty',
        41: 'Forty-one', 42: 'Forty-two', 43: 'Forty - three', 44: 'Forty - four', 45: 'Forty-five', 46: 'Forty - six', 47: 'Forty seven', 48: 'Forty eight', 49: 'Forty nine', 50: 'Fifty',
        51: 'Fifty-one', 52: 'Fifty-two', 53: 'Fifty-three', 54: 'Fifty-four', 55: 'Fifty-five', 56: 'Fifty-six', 57: 'Fifty-seven', 58: 'Fifty eight', 59: 'Fifty nine', 60: 'Sixty',
        61: 'Sixty one', 62: 'Sixty two', 63: 'Sixty three', 64: 'Sixty four', 65: 'Sixty five', 66: 'Sixty six', 67: 'Sixty seven', 68: 'Sixty eight', 69: 'Sixty nine', 70: 'Seventy',
        71: 'Seventy one', 72: 'Seventy two', 73: 'Seventy three', 74: 'Seventy four', 75: 'Seventy five', 76: 'Seventy six', 77: 'Seventy seven', 78: 'Seventy eight', 79: 'Seventy nine', 80: 'Eighty',
        81: 'Eighty one', 82: 'Eighty two', 83: 'Eighty three', 84: 'Eighty four', 85: 'Eighty five', 86: 'Eighty six', 87: 'Eighty seven', 88: 'Eighty eight', 89: 'Eighty nine', 90: 'Ninety',
        91: 'Ninety-one', 92: 'Ninety-two', 93: 'Ninety-three', 94: 'Ninety-four', 95: 'Ninety-five', 96: 'Ninety-six', 97: 'Ninety-seven', 98: 'Ninety-eight', 99: 'Ninety-nine', 100: 'One hundred'
}